Tekla Open API Reference for Tekla Structures 2025
Distance.Millimeters Property
 Gets or sets the distance in millimeters.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Millimeters { get; set; }
Public Property Millimeters As Double
	Get
	Set
Property Value
Type: Double
 The distance in millimeters.
Examples
 This example shows how to perform calculations with distances in different units.
using Tekla.Structures.Datatype;
public class Example
{
       public void Example1()
       {
           // The default unit type is millimeter.
           Distance value1 = new Distance(30);
           // Other unit types must be specified explicitly.
           Distance value2 = new Distance(2, Distance.UnitType.Inch);
           // Perform sum calculation using millimeters for both distances.
           Distance sumOfDistances = new Distance(value1.Millimeters + value2.Millimeters);
       }
}
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace